---
kind: property
id: P:Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFinishPeelamount
source: html/a2028bde-ab5f-a9f1-8370-51dd454e260e.htm
---
# Autodesk.Revit.DB.Visual.MetallicPaint.MetallicpaintFinishPeelamount Property

The property labeled "Amount" from the "MetallicPaint" schema.

## Syntax (C#)
```csharp
public static string MetallicpaintFinishPeelamount { get; }
```

## Remarks
This property is of type "AssetPropertyDouble" within the range of "0, 1".